spec/internal/app/admin/dashboard.rb

      column do
        panel "Info" do
          ul do
            li "Posts: #{Post.count}"
            li "Categories: #{Category.count}"
            li "Users: #{User.count}"
            li "RGB Colors: #{RgbColor.count}"
---
SELECT COUNT(*) FROM "posts"
SELECT COUNT(*) FROM "categories"
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "rgb_colors"

      column do
        panel "Recent Posts" do
          ul do
            Post.limit(5).map do |post|
---
SELECT "posts".* FROM "posts" LIMIT 5